Repository: 84000/data-translation-memory
Catalog: toh577-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པའི་གཟུངས།
en: The Dhāraṇī of “The Perfection of Wisdom in Twenty-Five Thousand Lines”

source: བཅོམ་ལྡན་འདས་མ་ཡུམ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the Blessed Lady, the Mother Perfection of Wisdom.

source: ཏདྱ་ཐཱ། ཨོཾ་པྲཛྙཱཔྲཛྙེ། པྲཛྙཱ་ཨ་བ་བྷཱ་སེ། པྲ་ཛྙཱ་བ་ལོ་ཀ་ཏི་སརྦ་དྷ་རྨ་ཨནྡྷ་ཀ་ར་བྷི་དྷ་མ་ནི། སིདྡྷེ་སུ་སིདྡྷ། སིདྡྷྱནྟུ་མཱཾ་བྷ་ག་བ་ཏི། སརྦ་ཛྙཱ་ནས་ནྔྷ་རི། བྷ་ག་བ་ཏི་བད་ཚེ་ལ། པྲ་ས་ར་དྷེ་ཧསྟ་མ་མ་སུ་ཀ་ར། སིདྡྷི་སིདྡྷི། བུདྡྷ་བུདྡྷ། ཀཾ་པ་ཀཾ་པ། པཱ་ལ་པཱ་ལ། དྷ་ར་དྷ་ར། བ་ར་བ་ར། གརྫ་གརྫ། ཨཱ་གཙྪ་ཨཱ་གཙྪ་བ་ག་བ་ཏི་མཱ་བི་ལམྦ་སྭཱ་ཧཱ།
en: tadyathā—oṃ prajñe mahāprajñe prajñāvabhāse prajñāvalokite sarva­dharmān­dhakāra­vidhamane siddhe susiddhe sidhyantu māṃ bhagavati sarvajñānasaṃdhāre bhagavati vatsale prasāritahaste mama sukara siddhi siddhi buddha buddha kampa kampa pāla pāla dhara dhara vara vara garja garja āgaccha āgaccha bhagavati mā vilamba svāhā!

source: འདི་བཟུང་བས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་གཟུང་བར་འགྱུར་རོ། །
en: By upholding this, one will have upheld The Perfection of Wisdom in Twenty-Five Thousand Lines.

source: ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་བྱང་བར་འགྱུར་རོ། །
en: All karmic obscurations will be purified.

source: འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པའི་གཟུངས་རྫོགས་སོ།།
en: Here ends “The Dhāraṇī of ‘The Perfection of Wisdom in Twenty-Five Thousand Lines.’ ”
